package days07;

//***매서드(함수) 설명
public class Ex08 {
	public static void main(String[] args) {
		//1. 정의
		//프로그래밍에서 "반복되는 명령어들"을 찾아 별도로 묶어서 필요할 때마다 재사용하도록 만든 것
		//2. 프로그램 구조화 -> 유지,보수, 관리 용이
		//3. 함수가 기본이 되는 프로그래밍 방식 = 구조적 프로그램
		//4. 객체가 기본이 되는 프로그래밍 방식 = 객체 지향적 프로그래밍 (oop)
		//5. aotjem (함수)의 선언형식
		// 접근+지정 => 수정자(modifier)
		// [접근지정자] [기타제어자] 리턴자료형 함수명 ([매개변수]) :함수의 원형 ==프로토타입(prototype)
		// :: 프로토타입  prototype '''리턴자료형 함수명 ([매개변수])''' {함수 몸체 } 
		//{ 함수의 몸체(body)
		//   [return리턴값;]
		// } 
		//6. 함수 3가지 파악 기능. 매개변수. 리턴값(리턴자료형)
	}//main

}//class
